package com.utils;


import java.util.Random;

public class NameGenerator {
	/**
	 * 生成名称，0为女名，1为男名
	 * @return
	 */
	public static Name generateName(){
		Random random = new Random();
		String firstName = firstNames[random.nextInt(firstNamesLength)];
		String secoundName = null;
		// 性别
		Integer sex = random.nextInt(2);
		if(sex == 0){
			secoundName = nvNames[random.nextInt(nvNamesLength)];
		}else {
			secoundName = nanNames[random.nextInt(nanNamesLength)];
		}
		return new Name(firstName+secoundName,sex);
	}
	
	private static String[] firstNames=("赵,钱,孙,李,周,吴,郑,王,冯,陈,诸,卫,蒋,沈,韩,杨,朱,秦,尤,许,何,吕,施,张,"
			+"孔,曹,严,华,金,魏,陶,姜,戚,谢,邹,喻,柏,水,窦,章,云,苏,潘,葛,奚,范,彭,郎,"
			+"鲁,韦,昌,马,苗,凤,花,方,俞,任,袁,柳,酆,鲍,史,唐,费,廉,岑,薛,雷,贺,倪,汤,"
			+"滕,殷,罗,毕,郝,邬,安,常,乐,于,时,傅,皮,卡,齐,康,伍,余,元,卜,顾,孟,平,黄,"
			+"和,穆,萧,尹,姚,邵,堪,汪,祁,毛,禹,狄,米,贝,明,臧,计,伏,成,戴,谈,宋,茅,庞,"
			+"熊,纪,舒,屈,项,祝,董,粱,杜,阮,蓝,闵,席,季,麻,强,贾,路,娄,危,江,童,颜,郭,"
			+"梅,盛,林,刁,钟,徐,邱,骆,高,夏,蔡,田,樊,胡,凌,霍,虞,万,支,柯,咎,管,卢,莫,"
			+"经,房,裘,缪,干,解,应,宗,丁,宣,贲,邓,郁,单,杭,洪,包,诸,左,石,崔,吉,钮,龚,"
			+"程,嵇,邢,滑,裴,陆,荣,翁,荀,羊,於,惠,甄,魏,家,封,芮,羿,储,靳,汲,邴,糜,松,"
			+"井,段,富,巫,乌,焦,巴,弓,牧,隗,山,谷,车,侯,宓,蓬,全,郗,班,仰,秋,仲,伊,宫,"
			+"宁,仇,栾,暴,甘,钭,厉,戎,祖,武,符,刘,景,詹,束,龙,叶,幸,司,韶,郜,黎,蓟,薄,"
			+"印,宿,白,怀,蒲,台,从,鄂,索,咸,籍,赖,卓,蔺,屠,蒙,池,乔,阴,郁,胥,能,苍,双,"
			+"闻,莘,党,翟,谭,贡,劳,逄,姬,申,扶,堵,冉,宰,郦,雍,却,璩,桑,桂,濮,牛,寿,通,"
			+"边,扈,燕,冀,郏,浦,尚,农,温,别,庄,晏,柴,翟,阎,充,慕,连,茹,习,宦,艾,鱼,容,"
			+"向,古,易,慎,戈,廖,庚,终,暨,居,衡,步,都,耿,满,弘,匡,国,文,寇,广,禄,阙,东,"
			+"殴,殳,沃,利,蔚,越,夔,隆,师,巩,厍,聂,晁,勾,敖,融,冷,訾,辛,阚,那,简,饶,空,"
			+"曾,毋,沙,乜,养,鞠,须,丰,巢,关,蒯,相,查,后,荆,红,游,竺,权,逯,盖,后,桓,公,"
			+"万俟,司马,上官,欧阳,夏侯,诸葛,闻人,东方,赫连,皇甫,尉迟,公羊,"
			+"澹台,公冶,宗政,濮阳,淳于,单于,太叔,申屠,公孙,仲孙,轩辕,令狐,"
			+"钟离,宇文,长孙,慕容,鲜于,闾丘,司徒,司空,亓官,司寇,仉督,子车,"
			+"颛孙,端木,巫马,公西,漆雕,乐正,壤驷,公良,拓拔,夹谷,宰父,谷粱,"
			+"晋楚,闫法,汝鄢,涂钦,段干,百里,东郭,南门,呼延,归海,羊舌,微生,"
			+"岳帅,缑亢,况后,有琴,梁丘,左丘,东门,西门,商牟,佘佴,伯赏,南宫").split(",");
	private static String[] nvNames = ("筠,柔,竹,霭,凝,晓,欢,霄,枫,芸,菲,寒,伊,亚,宜,可,姬,舒"+
			"影,荔,枝,思,丽,秀,娟,英,华,慧,巧,美,娜,静,淑,惠,珠,翠,"+
			"雅,芝,玉,萍,红,娥,玲,芬,芳,燕,彩,春,菊,勤,珍,贞,莉,兰,"+
			"凤,洁,梅,琳,素,云,莲,真,环,雪,荣,爱,妹,霞,香,月,莺,媛,"+
			"艳,瑞,凡,佳,嘉,琼,桂,娣,叶,璧,璐,娅,琦,晶,妍,茜,秋,珊,"+
			"莎,锦,黛,青,倩,婷,姣,婉,娴,瑾,颖,露,瑶,怡,婵,雁,蓓,纨,"+
			"仪,荷,丹,蓉,眉,君,琴,蕊,薇,菁,梦,岚,苑,婕,馨,瑗,琰,韵,"+
			"融,园,艺,咏,卿,聪,澜,纯,毓,悦,昭,冰,爽,琬,茗,羽,希,宁,"+
			"欣,飘,育,滢,馥,"+
			"梦琪,忆柳,之桃,慕青,问兰,尔岚,元香,初夏,沛菡,傲珊,曼文,乐菱,"+
			"痴珊,恨玉,惜文,香寒,新柔,语蓉,海安,夜蓉,涵柏,水桃,醉蓝,春儿,"+
			"语琴,从彤,傲晴,语兰,又菱,碧彤,元霜,怜梦,紫寒,妙彤,曼易,南莲,"+
			"紫翠,雨寒,易烟,如萱,若南,寻真,晓亦,向珊,慕灵,以蕊,寻雁,映易,"+
			"雪柳,孤岚,笑霜,海云,凝天,沛珊,寒云,冰旋,宛儿,绿真,盼儿,晓霜,"+
			"碧凡,夏菡,曼香,若烟,半梦,雅绿,冰蓝,灵槐,平安,书翠,翠风,香巧,"+
			"代云,梦曼,幼翠,友巧,听寒,梦柏,醉易,访旋,亦玉,凌萱,访卉,怀亦,"+
			"笑蓝,春翠,靖柏,夜蕾,冰夏,梦松,书雪,乐枫,念薇,靖雁,寻春,恨山,"+
			"从寒,忆香,觅波,静曼,凡旋,以亦,念露,芷蕾,千兰,新波,代真,新蕾,"+
			"雁玉,冷卉,紫山,千琴,恨天,傲芙,盼山,怀蝶,冰兰,山柏,翠萱,恨松,"+
			"问旋,从南,白易,问筠,如霜,半芹,丹珍,冰彤,亦寒,寒雁,怜云,寻文,"+
			"乐丹,翠柔,谷山,之瑶,冰露,尔珍,谷雪,乐萱,涵菡,海莲,傲蕾,青槐,"+
			"冬儿,易梦,惜雪,宛海,之柔,夏青,亦瑶,妙菡,春竹,痴梦,紫蓝,晓巧,"+
			"幻柏,元风,冰枫,访蕊,南春,芷蕊,凡蕾,凡柔,安蕾,天荷,含玉,书兰,"+
			"雅琴,书瑶,春雁,从安,夏槐,念芹,怀萍,代曼,幻珊,谷丝,秋翠,白晴,"+
			"海露,代荷,含玉,书蕾,听白,访琴,灵雁,秋春,雪青,乐瑶,含烟,涵双,"+
			"平蝶,雅蕊,傲之,灵薇,绿春,含蕾,从梦,从蓉,初丹。听兰,听蓉,语,芙"+
			"夏彤,凌瑶,忆翠,幻灵,怜菡,紫南,依珊,妙竹,访烟,怜蕾,映寒,友绿,"+
			"冰萍,惜霜,凌香,芷蕾,雁卉,迎梦,元柏,代萱,紫真,千青,凌寒,紫安,"+
			"寒安,怀蕊,秋荷,涵雁,以山,凡梅,盼曼,翠彤,谷冬,新巧,冷安,千萍,"+
			"冰烟,雅阳,友绿,南松,诗云,飞风,寄灵,书芹,幼蓉,以蓝,笑寒,忆寒,"+
			"秋烟,芷巧,水香,映之,醉波,幻莲,夜山,芷卉,向彤,小玉,幼南,凡梦,"+
			"尔曼,念波,迎松,青寒,笑天,涵蕾,碧菡,映秋,盼烟,忆山,以寒,寒香,"+
			"小凡,代亦,梦露,映波,友蕊,寄凡,怜蕾,雁枫,水绿,曼荷,笑珊,寒珊,"+
			"谷南,慕儿,夏岚,友儿,小萱,紫青,妙菱,冬寒,曼柔,语蝶,青筠,夜安,"+
			"觅海,问安,晓槐,雅山,访云,翠容,寒凡,晓绿,以菱,冬云,含玉,访枫,"+
			"含卉,夜白,冷安,灵竹,醉薇,元珊,幻波,盼夏,元瑶,迎曼,水云,访琴,"+
			"谷波,乐之,笑白,之山,妙海,紫霜,平夏,凌旋,孤丝,怜寒,向萍,凡松,"+
			"青丝,翠安,如天,凌雪,绮菱,代云,南莲,寻南,春文,香薇,冬灵,凌珍,"+
			"采绿,天春,沛文,紫槐,幻柏,采文,春梅,雪旋,盼海,映梦,安雁,映容,"+
			"凝阳,访风,天亦,平绿,盼香,觅风,小霜,雪萍,半雪,山柳,谷雪,靖易,"+
			"白薇,梦菡,飞绿,如波,又晴,友易,香菱,冬亦,问雁,妙春,海冬,半安,"+
			"平春,幼柏,秋灵,凝芙,念烟,白山,从灵,尔芙,迎蓉,念寒,翠绿,翠芙,"+
			"靖儿,妙柏,千凝,小珍,天巧。妙旋,雪枫,夏菡,元绿,痴灵,绮琴,雨双,"+
			"听枫,觅荷,凡之,晓凡,雅彤,香薇,孤风,从安,绮彤,之玉,雨珍,幻丝,"+
			"代梅,香波,青亦,元菱,海瑶,飞槐,听露,梦岚,幻竹,新冬,盼翠,谷云,"+
			"忆霜,水瑶,慕晴,秋双,雨真,觅珍,丹雪,从阳,元枫,痴香,思天,如松,"+
			"妙晴,谷秋,妙松,晓夏,香柏,巧绿,宛筠,碧琴,盼兰,小夏,安容,青曼,"+
			"千儿,香春,寻双,涵瑶,冷梅,秋柔,思菱,醉波,醉柳,以寒,迎夏,向雪,"+
			"香莲,以丹,依凝,如柏,雁菱,凝竹,宛白,初柔,南蕾,书萱,梦槐,香芹,"+
			"南琴,绿海,沛儿,晓瑶,听春,凝蝶,紫雪,念双,念真,曼寒,凡霜,飞雪,"+
			"雪兰,雅霜,从蓉,冷雪,靖巧,翠丝,觅翠,凡白,乐蓉,迎波,丹烟,梦旋,"+
			"书双,念桃,夜天,海桃,青香,恨风,安筠,觅柔,初南,秋蝶,千易,安露,"+
			"诗蕊,山雁,友菱,香露,晓兰,白卉,语山,冷珍,秋翠,夏柳,如之,忆南,"+
			"书易,翠桃,寄瑶,如曼,问柳,香梅,幻桃,又菡,春绿,醉蝶,亦绿,诗珊,"+
			"听芹,新之,易巧,念云,晓灵,静枫,夏蓉,如南,幼丝,秋白,冰安,秋白,"+
			"南风,醉山,初彤,凝海,紫文,凌晴,香卉,雅琴,傲安,傲之,初蝶,寻桃,"+
			"代芹,诗霜,春柏,绿夏,碧灵,诗柳,夏柳,采白,慕梅,乐安,冬菱,紫安,"+
			"宛凝,雨雪,易真,安荷,静竹,代柔,丹秋,绮梅,依白,凝荷,幼珊,忆彤,"+
			"凌青,之桃,芷荷,听荷,代玉,念珍,梦菲,夜春,千秋,白秋,谷菱,飞松,"+
			"初瑶,惜灵,恨瑶,梦易,新瑶,曼梅,碧曼,友瑶,雨兰,夜柳,香蝶,盼巧,"+
			"芷珍,香卉,含芙,夜云,依萱,凝雁,以莲,易容,元柳,安南,幼晴,尔琴,"+
			"飞阳,白凡,沛萍,雪瑶,向卉,采文,乐珍,寒荷,觅双,白桃,安卉,迎曼,"+
			"盼雁,乐松,涵山,恨寒,问枫,以柳,含海,秋春,翠曼,忆梅,涵柳,梦香,"+
			"海蓝,晓曼,代珊,春冬,恨荷,忆丹,静芙,绮兰,梦安,紫丝,千雁,凝珍,"+
			"香萱,梦容,冷雁,飞柏,天真,翠琴,寄真,秋荷,代珊,初雪,雅柏,怜容,"+
			"如风,南露,紫易,冰凡,海雪,语蓉,碧玉,翠岚,语风,盼丹,痴旋,凝梦,"+
			"从雪,白枫,傲云,白梅,念露,慕凝,雅柔,盼柳,半青,从霜,怀柔,怜晴,"+
			"夜蓉,代双,以南,若菱,芷文,寄春,南晴,恨之,梦寒,初翠,灵波,巧春,"+
			"问夏,凌春,惜海,亦旋,沛芹,幼萱,白凝,初露,迎海,绮玉,凌香,寻芹,"+
			"秋柳,尔白,映真,含雁,寒松,友珊,寻雪,忆柏,秋柏,巧风,恨蝶,青烟,"+
			"问蕊,灵阳,春枫,又儿,雪巧,丹萱,凡双,孤萍,紫菱,寻凝,傲柏,傲儿,"+
			"友容,灵枫,尔丝,曼凝,若蕊,问丝,思枫,水卉,问梅,念寒,诗双,翠霜,"+
			"夜香,寒蕾,凡阳,冷玉,平彤,语薇,幻珊,紫夏,凌波,芷蝶,丹南,之双,"+
			"凡波,思雁,白莲,从菡,如容,采柳,沛岚,惜儿,夜玉,水儿,半凡,语海,"+
			"听莲,幻枫,念柏,冰珍,思山,凝蕊,天玉,问香,思萱,向梦,笑南,夏旋,"+
			"之槐,元灵,以彤,采萱,巧曼,绿兰,平蓝,问萍,绿蓉,靖柏。迎蕾,碧曼,"+
			"思卉,白柏,妙菡,怜阳,雨柏,雁菡,梦之,又莲,乐荷,寒天,凝琴,书南,"+
			"映天,白梦,初瑶,恨竹,平露,含巧,慕蕊,半莲,醉卉,天菱,青雪,雅旋,"+
			"巧荷,飞丹,恨云,若灵").split(",");
	
	private static String[] nanNames =("磊,镇,博,连,尧,浩,溪,越,宜,家,辉,礼,春,"+
			"函,洲,志,星,励,锐,禾,蔚,登,丞,强,全,传,"+
			"宇,世,纪,然,洋,巩,展,佳,敖,顺,鑫,朋,圣,"+
			"民,瑞,可,睿,齐,岩,晓,森,子,影,向,望,宪,"+
			"起,充,祥,骅,隆,斌,玉,忠,江,滔,涵,维,虹,"+
			"迎,同,与,帆,安,议,意,儒,卫,梓,迅,舜,德,"+
			"友,佚,瑜,基,衡,韵,良,明,泊,骏,山,钊,献,"+
			"清,纶,林,蒙,正,琛,为,语,军,平,勇,昊,兵,"+
			"谊,源,远,朗,邦,奕,祖,泽,中,城,蕾,融,谋,"+
			"冠,信,力,理,颜,生,伦,方,曦,蓝,和,荣,亮,"+
			"岚,晗,畅,晨,昌,绍,略,昭,泓,皓,毅,豪,驰,"+
			"津,威,金,刚,沣,臻,雨,欣,鸿,政,达,名,川,"+
			"材,成,嘉,立,廷,增,济,震,钦,韬,璟,竹,文,"+
			"涛,永,翔,洁,利,序,谱,海,新,景,跃,琪,宏,"+
			"希,俊,功,采,风,瀚,耀,双,宝,恒,伟,富,大,"+
			"英,智,照,怡,学,腾,庆,焘,先,晟,亿,凤,盛,"+
			"帅,亦,乐,锋,铭,罡,亭,凯,仁,靖,辰,悦,栋,"+
			"群,轩,垒,华,誉,备,科,珑,建,笑,波,益,至,"+
			"易,万,诗,元,宣,旭,胜,进,才,骁,溓,洪,歌,"+
			"兴,东,峰,章,坤,凡,聪,来,贤,阳,韦,言,飞,"+
			"振,钢,奎,宁,丰,广,朔,钧,升,超,国,珺,选,"+
			"霖,士,锦,霆,映,哲,崇,恩,云,泰,崊,淼,诚,"+
			"高,月,健,晔,航,庭,雄,之,谦,策,咏,鹏,启,"+
			"彦,冬,时,州,牧,堂,奇,彰,福,艺,业,义,聚,"+
			"钟源,金山,泽中,习涛,宇矾,堂臻,一漪,一澍,永风,京明,"+
			"彦哲,文嘉,书宁,一毅,书乐,昊洲,书林,立立,霏雨,焯勾,"+
			"岩松,扬菲,卫国,垌菲,喜成,晶林,荔荔,文烨,建雄,金金,"+
			"军生,致齐,书显,建新,金利,力千,轴毛,钊幸,珏珲,先涛,"+
			"浩宇,小平,建基,琛琛,烯冰,璇冰,孟学,韦嵘,宗耀,轺介,"+
			"惠卿,宗台,茜冰,凤军,佳钰,小明,又仁,锴锐,招新,召营,"+
			"乘昊,永靖,小军,永静,汝君,思彤,汉元,依潼,依凡,欣瑜,"+
			"逸樊,圣祥,楠楠,传方,欣尉,函珏,城瑞,异才,传舫,奕灿,"+
			"依培,嘉欣,艳秋,传祥,传禄,志强,焕香,志嘉,映廷,东峰,"+
			"传贵,逸矾,传福,海语,矾逸,文吉,知娴,再香,索娴,任杰,"+
			"豫坤,留生,策驰,振中,林峰,林丰,梁宏,临峰,临锋,传澎,"+
			"矾豫,晓东,临风,传龙,若然,传鑫,凌风,大为,力仁,允灏,"+
			"利仁,宝涛,佳明,筱璇,思帅,政翰,宇博,文会,稼傲,佳烈,"+
			"稼音,稼金,稼辛,稼竹,富豪,辰翔,凯岳,敬海,振宇,锦容,"+
			"锡海,钧玮,庆敏,文龙,逢厅,祚玮,全民,兴碧,乙默,金元,"+
			"书含,雪容,馥凤,璐菲,雨晗,馥毓,家池,梦菲,梦如,洪娇,"+
			"羽姗,校国,如姬,红延,记言,蕊瑗,定峰,智勇,言卿,羽纯,"+
			"康庆,志佳,如真,蕊菁,馥连,强强,羽真,雨洋,厚源,厚军,"+
			"品言,志楷,伟康,品声,宝影,志勇,容伊,本康,美君,明驿,"+
			"一赫,绪新,慧峰,坤铎,思君,俊采,翔宇,飞菲,雪淇,广欢,"+
			"泞鹪,庆昌,顺香,梦暄,欣逸,晓坤,广应,其运,淇兴,镜桦,"+
			"季恒,书帛,炀霏,龙斌,玉华,卉霖,玮宏,永明,宇浩,少春,"+
			"续豪,雁君,誉玮,培杰,绢踏,稀绚,德友,英智,双庆,子辰,"+
			"子芯,蒙蒙,玮檬,牧归,佳龙,靖心,炜航,玉平,江华,兴友,"+
			"嘉锦,天哲,珈慧,茂溪,馨蔓,诵旭,丰源,微云,祥熙,忆轩,"+
			"俊屹,营宝,姝妤,毓徽,苑涵,顺耀,泽伟,明荣,齐天,希宗,"+
			"泣涵,和峰,松南,峻凝,连超,衍煊,是羽,弘渝,驭轩,子含,"+
			"訾劾,成秀,艳君,女雯,耀耀,羽茜,玉抒,浩瑞,琰苗,小轩,"+
			"志波,煜景,格峰,思聪,昕瞳,奕杉,孟绅,正光,振武,恩仪,"+
			"永峻,文京,逸然,国诚,之伦,毅百,龙淼,柘凤,云帆,方宁,"+
			"寒镜,雷震,温枝,晋强,玄彤,智图,材旭,全智,德遥,德承,"+
			"德兴,云龙,俊皓,文尚,文舟,弘俊,星宇,辉城,玮羽,安荣,"+
			"育德,翰庭,雨棋,德远,昌楠,江杉,世璋,鼎羽,知国,尚兴,"+
			"雨博,新雄,君宇,文复,博明,德畅,乔松,柏枝,哲欧,进德,"+
			"雨遥,仁承,哲星,晋尚,翰蝶,弘瑾,翰景,智彤,俊施,棋柳,"+
			"睿哲,金波,文松,承天,善诚,桦影,棋泰,道振,圣信,德盛,"+
			"棋语,弘易,顺庆,棋润,寒彤,圣皓,雨辉,柏城,辉宇,文恩,"+
			"杰鹤,哲城,彬承,健棋,圣磊,玮弘,乐城,博言,荣华,文启,"+
			"朴诚,君辰,明新,玮业,宇恒,君谦,乾君,晋裕,俊熙,彬棋,"+
			"博旭,松韵,智明,文瑜,博欧,彬泰,君遥,强峻,韵轩,文辉,"+
			"博福,展毅,唯金,远乔,柏君,文标,韵诚,贵博,博进,新诚,"+
			"浩云,远葸,清瑜,墨晗,龙飞,宗良,维顺,瀚辰,改珍,思敏,"+
			"长春,红年,孟钰,桐瑞,星月,中源,行平,咏棣,作忠,宗佑,").split(",");
	private static Integer firstNamesLength;
	private static Integer nanNamesLength;
	private static Integer nvNamesLength;
	static{
		firstNamesLength = firstNames.length;
		nanNamesLength = nanNames.length;
		nvNamesLength = nvNames.length;
	}
	
	static class Name {
		private String name;
		private Integer sex;
		
		
		public Name(String name, Integer sex) {
			super();
			this.name = name;
			this.sex = sex;
		}
		public Name() {
			super();
		}
		public String getName() {
			return name;
		}
		public void setName(String name) {
			this.name = name;
		}
		public Integer getSex() {
			return sex;
		}
		public void setSex(Integer sex) {
			this.sex = sex;
		}
		@Override
		public String toString() {
			return "Name [name=" + name + ", sex=" + sex + "]";
		}
	}

}
